## Concatenate

### 1. Concatenate rows of two data frames and assign keys

In [2]:
import pandas as pd
df1 = pd.DataFrame({
'ID':[101,102,103,104,105],
'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
'Subject':['Maths','English','Science','German','History']})

df2 = pd.DataFrame(
{'ID':[101,102,103,104,105],
'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
'Subject':['English','Science','Social Science','German','History']})

In [6]:
# Your code here 
c=pd.concat([df1,df2], ignore_index=True)
c

    ID    Name         Subject
0  101    Alex           Maths
1  102     Amy         English
2  103   Allen         Science
3  104   Alice          German
4  105  Ayoung         History
5  101   Billy         English
6  102   Brian         Science
7  103    Bran  Social Science
8  104   Bryce          German
9  105   Betty         History

### 2. Concatenate the two data frame and clear the existing index

In [7]:
df_1 = pd.DataFrame([['a', 1], ['b', 2]], columns=['letter', 'number']) 
df_2 = pd.DataFrame([['c', 3], ['d', 4]], columns=['letter', 'number'])

In [8]:
# Your code here 

c=pd.concat([df_1,df_2], ignore_index=True)
c

  letter  number
0      a       1
1      b       2
2      c       3
3      d       4